-- =============================================================================
-- AdaptiveBot Phase 4: 10 大冒险者公会专属通信使魔实体模版 (Entry: 70201 - 70210)
-- 纯增量独立数据，零侵入、零修改暴雪原生怪物数据表
-- =============================================================================

DELETE FROM `creature_template` WHERE `entry` BETWEEN 70201 AND 70210;

INSERT INTO `creature_template` 
(`entry`, `modelid1`, `name`, `subname`, `IconName`, `gossip_menu_id`, `minlevel`, `maxlevel`, `faction`, `npcflag`, `speed_walk`, `speed_run`, `scale`, `rank`, `unit_class`, `unit_flags`, `type`, `type_flags`, `RegenHealth`, `flags_extra`, `ScriptName`) VALUES
(70201, 2487,  '探险者协会通信使魔',   '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 9, 0, 1, 0, 'npc_bot_guild_pet'), -- 机械松鼠
(70202, 2073,  '军情七处通信使魔',     '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 黑猫
(70203, 2074,  '银色盟约通信使魔',     '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 白猫
(70204, 2077,  '战歌远征队通信使魔',   '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 黑王蛇
(70205, 17467, '夺日者通信使魔',       '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 红尾金龙鱼
(70206, 2076,  '死亡猎手通信使魔',     '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 地穴蟑螂
(70207, 29013, '银色北伐军通信使魔',   '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 7, 0, 7, 0, 1, 0, 'npc_bot_guild_pet'), -- 银色侍从
(70208, 27581, '下水道黑市通信使魔',   '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 下水道巨鼠
(70209, 28549, '塞纳里奥通信使魔',     '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'), -- 春兔
(70210, 2080,  '热砂财阀通信使魔',     '<冒险者公会使魔>', 'Speak', 0, 80, 80, 35, 1, 1.0, 1.14286, 1.0, 0, 1, 0, 1, 0, 1, 0, 'npc_bot_guild_pet'); -- 树蛙
